---
kind: enumMember
id: F:Autodesk.Revit.DB.BRepType.Void
enum: Autodesk.Revit.DB.BRepType
source: html/7006d069-f606-c27a-8c77-30cbdbc263d1.htm
---
# Autodesk.Revit.DB.BRepType.Void

The output geometry is expected to represent a (possibly disconnected) void (i.e., an inverted solid).